---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Events.PreEventArgs
source: html/2d7bd77f-fd98-b2b7-7aa5-68b9fcb729c5.htm
---
# PreEventArgs Members

Indicates whether the event is being cancelled.
When the event is cancellable, set the property to True to cancel it.